In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
import seaborn
import statistics

In [2]:
# load Data
Jobs_data = pd.read_csv("Jobs_Clean.csv")
Jobs_data.head()

,Unnamed: 0,Job Title,Job Description,Rating,Company Name,Location,Headquarters,Size,Founded,Type of ownership,Industry,Sector,Revenue,Competitors,Salary,Age
0,0,Junior Data Analyst,Role: Junior Data Analyst\n\nLocation: Gurgaon...,3.3,GroundTruth,Gurgaon,"New York, NY",201 to 500 employees,2009.0,Company - Private,NaN,Other,Unknown / Non-Applicable,NaN,503000.0,11.0
1,1,Senior Solutions Architect,Title: Senior Solutions Architect\n\nLocation:...,3.0,phData,Bengaluru,"Minneapolis, MN",51 to 200 employees,2014.0,Company - Private,IT Services,Information Technology,Unknown / Non-Applicable,NaN,1058600.0,6.0
2,2,"Advisor, Data Science & Analytics","What We'll Bring:\n\nTransUnion, a global info...",4.0,TransUnion,Chennai,"Chicago, IL",5001 to 10000 employees,1968.0,Company - Public,Financial Analytics & Research,Finance,₹100 to ₹500 billion (INR),NaN,270000.0,52.0
3,3,Data Scientist,Job Description – Data Scientist\n\nLocation: ...,3.5,Buckman,Chennai,"Memphis, TN",1001 to 5000 employees,1945.0,Company - Private,Chemical Manufacturing,Manufacturing,₹50 to ₹100 billion (INR),NaN,569250.0,75.0
4,4,Data Science (Jupyter/Azure ML/MatLab),Accenture Technology powers our clients busine...,3.9,Accenture,Hyderabad,"Dublin, Ireland",10000+ employees,1989.0,Company - Public,Consulting,Business Services,₹500+ billion (INR),"Cognizant Technology Solutions, EY, McKinsey &...",956902.6,31.0

In [3]:
Jobs_data.drop(['Unnamed: 0'],axis=1,inplace=True)

In [5]:
#python
Jobs_data['python_yn'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'python' in x.lower() else 0)
Jobs_data.python_yn.value_counts()

1    840
0    660
Name: python_yn, dtype: int64

In [31]:
#r studio 
Jobs_data['R_yn'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'r python' in x.lower() or 'r/' in x.lower() else 0)
Jobs_data.R_yn.value_counts()

0    1267
1     233
Name: R_yn, dtype: int64

In [35]:
#Big-Data 
Jobs_data['spark'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'spark' in x.lower() or 'hadoop' in x.lower()  or 'kafka' in x.lower() else 0)
Jobs_data.spark.value_counts()

0    1067
1     433
Name: spark, dtype: int64

In [8]:
#aws 
Jobs_data['aws'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'aws' in x.lower() else 0)
Jobs_data.aws.value_counts()

0    1211
1     289
Name: aws, dtype: int64

In [9]:
#excel
Jobs_data['excel'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'excel' in x.lower() else 0)
Jobs_data.excel.value_counts()

1    753
0    747
Name: excel, dtype: int64

In [13]:
#checking for experience requirements
Jobs_data['experience'] = Jobs_data['Job Description'].apply(lambda x: 1 if 'years' in x.lower() else 0)
Jobs_data.experience.value_counts()

1    1087
0     413
Name: experience, dtype: int64

In [14]:
a=[]
# b=[] #debugging
for j in Jobs_data['Job Description']:
    if 'years' in j.lower():
        l=[]
        x = j[j.find('years')-20:j.find('years')+20]
        i=0
        while(i<len(x)):
            if x[i:i+2].isdigit():
                l.append(int(x[i:i+2]))
                i+=1
            elif x[i].isdigit():
                l.append(int(x[i]))  
            i+=1
    if len(l)>0:
#         a.append(l) #Debugging
        a.append(statistics.mean(l))
    else:
        a.append(0)
#     b.append(x) #debugging           

Jobs_data['years_exp']=a
# Jobs_data['years_exp2']=b

# To understand data better
for i in Jobs_data[Jobs_data['years']==0].index.values:
    print('Location : {} \n'.format(Jobs_data.loc[i]['Location']))
    print(Jobs_data.loc[i]['Job Description'])
    print('_____________________________________________________________________________________')